#+title: Yuri Template -- an RFC6570 implementation
#+options: toc:nil
#+property: header-args:elixir :script mix :session readme :exports both :cache yes

#+begin_export markdown
> This file is automatically generated from `README.org`. Do not edit
> manually.
#+end_export

* What
=yuri_template= is an implementation of [[https://tools.ietf.org/html/rfc6570][RFC6570]], that describes the
template language for URIs. It can be used to generate hierarchical
URIs, queries, fragments, and more.

* Alternatives

** [[https://hex.pm/packages/uri_template][=uri_template=]]
Another implementation of the same RFC. Uses regular expressions to
parse templates and can silently ignore errors in them.

** [[https://hexdocs.pm/elixir/URI.html][URI]]
Built-in module for managing URIs. It does not support templates,
but can handle simple tasks, such as encoding a query.

* Examples
#+begin_src elixir
YuriTemplate.expand!("https://tools.ietf.org{/path*}", path: ["html", "rfc6570"])
#+end_src

#+RESULTS[4b90e1f70018253a4ea3e971f98906dcfad39243]:
: "https://tools.ietf.org/html/rfc6570"

* Copyright notice
#+begin_example
Copyright 2020 Ivan Sokolov

Licensed under the Apache License, Version 2.0 (the "License");
you may not use this file except in compliance with the License.
You may obtain a copy of the License at

http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing, software
distributed under the License is distributed on an "AS IS" BASIS,
WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
See the License for the specific language governing permissions and
limitations under the License.
#+end_example

* COMMENT Local variables
# Local Variables:
# eval: (add-hook 'after-save-hook #'org-md-export-to-markdown nil t)
# End:
